#+TITLE: Finalising Exploring Eurovision Data  v2.0
#+AUTHOR: Antonio Mendes
#+EMAIL: <antonio.mendes@mlprograms.com>
#+DATE: 22 / 05 / 2020
#+PROPERTY: header-args :exports both :session caps_exp :results value
****** Top 10 Genres
#+BEGIN_SRC python
top_df = filtered_spotify_df[
  filtered_spotify_df.genre_name_0.isin(aggregate_spotify_df.iloc[-10:].genre)
  | filtered_spotify_df.genre_name_1.isin(aggregate_spotify_df.iloc[-10:].genre)
  | filtered_spotify_df.genre_name_2.isin(aggregate_spotify_df.iloc[-10:].genre)
  | filtered_spotify_df.genre_name_3.isin(aggregate_spotify_df.iloc[-10:].genre)
  | filtered_spotify_df.genre_name_4.isin(aggregate_spotify_df.iloc[-10:].genre)
  | filtered_spotify_df.genre_name_5.isin(aggregate_spotify_df.iloc[-10:].genre)
  | filtered_spotify_df.genre_name_6.isin(aggregate_spotify_df.iloc[-10:].genre)
]

max_genres = 0
for i in range(len(top_df)):
  if len(top_df["genres"].iloc[i].split("$$$")) > max_genres:
    max_genres = len(top_df["genres"].iloc[i].split("$$$"))

top_df[[
  "year",
  "country",
  "genre_name_0",
  "genre_name_1",
  "genre_name_2",
  "genre_name_3",
  "genre_name_4",
]]
#+END_SRC

#+RESULTS:
#+begin_example
     year    country              genre_name_0            genre_name_1      genre_name_2   genre_name_3    genre_name_4
42   2011      Angel               russian pop                                                                         
73   2012     Sweden                electropop                 europop        eurovision    swedish pop                
111  2013     Norway                electropop           norwegian pop                                                 
141  2013      Bonus                  big room               dance pop               edm            pop                
149  2014    Austria                eurovision                   strut                                                 
152  2014     Sweden       classic swedish pop                 europop  swedish idol pop    swedish pop                
186  2015     Sweden                   europop              eurovision  swedish idol pop    swedish pop                
187  2015     Russia                eurovision       russian dance pop       russian pop                               
188  2015      Italy  italian progressive rock            operatic pop                                                 
226  2016    Ukraine                eurovision               tatar pop   ukrainian indie  ukrainian pop  ukrainian rock
227  2016  Australia            australian pop  australian talent show        eurovision    talent show                
228  2016     Russia                eurovision       russian dance pop       russian pop                               
230  2016     Sweden          swedish idol pop                                                                         
264  2016   Interval                   europop              eurovision  swedish idol pop    swedish pop                
273  2017     Sweden                   europop              eurovision  swedish idol pop    swedish pop                
314  2018    Germany                german pop                     pop         viral pop                               
342  2018    Belarus                eurovision       russian dance pop       russian pop  ukrainian pop                
364  2019     Russia                eurovision       russian dance pop       russian pop                               
395  2019    Ukraine                eurovision             russian pop     ukrainian pop                               
#+end_example

****** Bottom 10 Genres
#+BEGIN_SRC python
bot_df = filtered_spotify_df[
  filtered_spotify_df.genre_name_0.isin(  aggregate_spotify_df.iloc[:10].genre)
  | filtered_spotify_df.genre_name_1.isin(aggregate_spotify_df.iloc[:10].genre)
  | filtered_spotify_df.genre_name_2.isin(aggregate_spotify_df.iloc[:10].genre)
  | filtered_spotify_df.genre_name_3.isin(aggregate_spotify_df.iloc[:10].genre)
  | filtered_spotify_df.genre_name_4.isin(aggregate_spotify_df.iloc[:10].genre)
  | filtered_spotify_df.genre_name_5.isin(aggregate_spotify_df.iloc[:10].genre)
  | filtered_spotify_df.genre_name_6.isin(aggregate_spotify_df.iloc[:10].genre)
]

max_genres = 0
for i in range(len(bot_df)):
  if len(bot_df["genres"].iloc[i].split("$$$")) > max_genres:
    max_genres = len(bot_df["genres"].iloc[i].split("$$$"))

bot_df[[
  "year",
  "country",
  "genre_name_0",
  "genre_name_1",
  "genre_name_2",
  "genre_name_3",
]]
#+END_SRC

#+RESULTS:
#+begin_example
     year         country     genre_name_0        genre_name_1    genre_name_2 genre_name_3
38   2010     Switzerland        swiss pop                                                 
55   2011     Switzerland      swiss indie           swiss pop                             
59   2011           Spain   galician indie                                                 
90   2012  United Kingdom  adult standards  brill building pop  easy listening       lounge
128  2013         Finland       eurovision         finnish pop                             
167  2014        Slovenia    slovenian pop      slovenian rock                             
207  2015         Austria     austrian pop          eurovision                             
335  2018         Finland       eurovision    finnish idol pop     finnish pop             
339  2018     Switzerland       eurovision           swiss pop                             
379  2019         Austria     austrian pop                                                 
#+end_example

****** plot_cluster_performance()
#+BEGIN_SRC python
def plot_cluster_performance(
  merged_df_dict,
  feature_x,
  feature_y,
  feature_z=None,
  feature_v=None,
  clusters=4,
  include_min_max = False,
):
  x = get_feature_from_key(feature_x)
  y = get_feature_from_key(feature_y)
  data = np.array([x,y]).transpose()
  feature_columns = get_columns_from_keys([feature_x, feature_y])
  if feature_z is not None and feature_v is None:
    z = get_feature_from_key(feature_z)
    data = np.array([x,y,z]).transpose()
    feature_columns = get_columns_from_keys([feature_x, feature_y, feature_z]) 
  elif feature_z is not None and feature_v is not None:
    z = get_feature_from_key(feature_z)
    v = get_feature_from_key(feature_v)
    data = np.array([x,y,z,v]).transpose()
    feature_columns = get_columns_from_keys([
      feature_x, 
      feature_y, 
      feature_z,
      feature_v
    ]) 
  feature_df, X = get_feature_df(feature_columns)[2:]
  kmeans   = KMeans(n_clusters=clusters, random_state=0).fit(data)
  labels   = kmeans.labels_
  feature_df["label"] = labels
  merged_feature_df = pd.merge(feature_df, filtered_spotify_df, on=["year","year_country"])
  merged_df_dict[" + ".join(feature_columns)] = merged_feature_df
  merged_feature_df = merged_feature_df.dropna(subset=["place_final"])
  df = pd.DataFrame({
    "label" : merged_feature_df.label,
    "place_final" : merged_feature_df.place_final
  })
  grouped_df = df.groupby(["label"], sort=True).mean()
  average_df = pd.DataFrame({
    "label" : grouped_df.index.to_numpy(),
    "place_final" : grouped_df["place_final"]
  })
  average_df = average_df.sort_values(by=["place_final"], ascending=False)
  fig = plt.figure(figsize=(38,34))
  ax = fig.add_subplot(111)
  x = np.arange(len(average_df))
  y = np.array(average_df["place_final"])
  ax.scatter(
    x,
    y,
    s=2000,
    linewidth=4,
    #alpha=0.6,
    edgecolor="k",
    zorder=1,
    label = "average"
  )
  ax.plot(
    x, y,
    linewidth=10,
    color="orange",
    zorder=0
  )
  if(include_min_max == True):
    grouped_df = df.groupby(["label"], sort=True).max()
    max_df = pd.DataFrame({
      "label" : grouped_df.index.to_numpy(),
      "policy_amnt" : grouped_df["place_final"]
    })
    x = np.arange(len(max_df))
    y = np.array(max_df["place_final"])
    ax.scatter(
      x,
      y,
      s=2000,
      linewidth=4,
      marker="^",
      edgecolor="k",
      zorder=1,
      label="max",
    )
    grouped_df = df.groupby(["label"], sort=True).min()
    min_df = pd.DataFrame({
      "label" : grouped_df.index.to_numpy(),
      "place_final" : grouped_df["place_final"]
    })
    x = np.arange(len(min_df))
    y = np.array(min_df["place_final"])
    ax.scatter(
      x,
      y,
      s=2000,
      linewidth=4,
      marker="v",
      edgecolor="k",
      zorder=1,
      label="min"
    )
    ax.legend(prop={"size" : 40})
  title = str(
    "Relationship between KMeans Labels, from "
    + str(feature_x)
    + "\n"
    + "and "
    + str(feature_y)
    + ", and =place_final"
  )
  if feature_z is not None and feature_v is None:
    title = str(
      "Relationship between KMeans Labels, from "
      + str(feature_x)
      + ",\n"
      + str(feature_y)
      + ", and"
      + str(feature_z)
      + ", and =place_final="
    )
  ax.set_title(title, pad=60, fontsize=70)
  ax.set_xlabel("Label", labelpad=40, fontsize=60)
  ax.set_ylabel("average =place_final=", labelpad=40, fontsize=60)
  if(include_min_max == True):
    ax.set_ylabel("average =place_final=", labelpad=40, fontsize=60)
  ax.set_xlim(
    np.min(x) -0.5,
    np.max(x) + 0.5
  )
  #ax.set_ylim(0, np.max(scatter_y) + 20)
  ax.tick_params(axis="x", labelsize=48)
  if(clusters >= 30):
    font_reduction = 6 * (clusters - 20)/10
    ax.tick_params(axis="x", labelsize=48 - font_reduction)
  ax.tick_params(axis="y", labelsize=48)
  ax.yaxis.set_major_locator(ticker.MultipleLocator(5))
  ax.set_ylim(0,27)
  ax.set_xticks(x)
  string_labels = list()
  for lbl in average_df.label:
    if len(str(lbl)) == 1:
      string_labels.append(str(lbl).zfill(2))
    else:
      string_labels.append(str(lbl))
  ax.set_xticklabels(string_labels)
  #ax.yaxis.set
  filename = str(
    "label_plot_"
    + str(feature_x)
    + "_"
    + str(feature_y)
    + "_"
    + str(clusters)
    + ".png"
  )
  if feature_z is not None:
    filename = str(
      "label_plot_"
      + str(feature_x)
      + "_"
      + str(feature_y)
      + "_"
      + str(feature_z)
      + "_"
      + str(clusters)
      + ".png"
    )
  if(include_min_max == True):
    filename = str(filename[:11] +  "min_max_" + filename[11:])
  print("filename:",filename)
  plt.savefig(fig_dir / "plots" /filename, bbox_inches="tight")
  plt.close("all")
  return fig_dir / "plots" / filename
#+END_SRC

#+RESULTS:
: /Users/antoniomendes/AUC_code/capstone/plots/label_plot_diss_mean_sil_mean_40.png

****** Getting Cluster Plots
#+BEGIN_SRC python
best_combinations = list(best_sil_score_dict.keys())
merged_df_dict = dict()
inertia_dict = dict()
distortion_dict = dict()
path = ""
#plt.rcParams["font.family"] = "Times New Roman"
for feature_key in best_combinations:
  inertia_dict[feature_key], distortion_dict[feature_key], path = plot_elbow_method(feature_key)
  merged_df_dict, path = plot_cluster_performance_from_elbow(
    merged_df_dict, 
    inertia_dict,
    distortion_dict,
    feature_key
  )

path
#+END_SRC

#+RESULTS:
: /Users/antoniomendes/AUC_code/capstone/plots/label_elbow_plot_hfc_mean_spec_rms_mean.png

***** plot_clusters_pca_all()
#+BEGIN_SRC python
def plot_clusters_pca_all(
  features, components, 
  inertia_clusters, 
  distortion_clusters, 
  method = "pca_kmeans",
  file_extension = "png"
):
  feature_df, X = get_feature_df(get_columns_from_keys(get_feature_keys(features)))[2:]
  feature_columns = get_columns_from_keys(get_feature_keys(features))
  scaler = StandardScaler()
  seg_X = scaler.fit_transform(X)
  pca = PCA(n_components = components)
  scores_pca = pca.fit_transform(seg_X)
  cluster_amount = [inertia_clusters, distortion_clusters]
  values_between = [np.min(cluster_amount) + i for i in range(1, (np.max(cluster_amount) - np.min(cluster_amount)))]
  fig, ax = plt.subplots(
    len(values_between), 3, 
    sharex=False, 
    #sharey=True, 
    sharey=False,
    figsize=(30 * len(values_between), 40 * len(values_between))
  )
  elbow_types    = ["inertia", "distortion", "between"]
  elbow_colors = [
    '008fd5', 
    'fc4f30', 
    'e5ae38', 
    '6d904f', 
    '8b8b8b', 
    '810f7c'
  ]
  for i, cluster_value in enumerate(values_between):
    cluster_sizes = [inertia_clusters, distortion_clusters, cluster_value]
    for j, eb in enumerate(elbow_types):
      model = KMeans(n_clusters=cluster_sizes[j], random_state=0).fit(scores_pca)
      labels   = model.labels_
      feature_df["label"] = labels
      merged_feature_df = pd.merge(feature_df, filtered_spotify_df, on=["year","year_country"])
      merged_feature_df = merged_feature_df.dropna(subset=["place_final"])
      df = pd.DataFrame({
        "label" : merged_feature_df.label,
        "place_final" : merged_feature_df.place_final
      })
      grouped_df = df.groupby(["label"], sort=True).mean()
      average_df = pd.DataFrame({
        "label" : grouped_df.index.to_numpy(),
        "place_final" : grouped_df["place_final"]
      })
      average_df = average_df.sort_values(by=["place_final"], ascending=False)
      x = np.arange(len(average_df))
      y = np.array(average_df["place_final"])
      ax[i,j].scatter(
        x,
        y,
        s=2000,
        linewidth=4,
        #alpha=0.6,
        edgecolor="k",
        zorder=1,
      )
      ax[i,j].plot(
        x, y,
        linewidth=10,
        color="orange",
        zorder=0
      )
      ax[i,j].set_xlim(
        np.min(x) -0.5,
        np.max(x) + 0.5
      )
      plot_title = str(
        str(cluster_sizes[j]) 
        + " Clusters from " 
        + elbow_types[j]
      ).title()
      ax[i,j].set_title(
        plot_title, 
        pad=20, 
        fontsize=72
      ) 
      #if((i+1) == len(values_between)):
      ax[i,j].set_xlabel("Label", labelpad=40, fontsize=60)
      if(j == 0):
        ax[i,j].set_ylabel("Place at Finals", labelpad=40, fontsize=60)
      ax[i,j].tick_params(axis="x", labelsize=48)
      if(cluster_sizes[j] >= 30):
        font_reduction = 8 * (cluster_sizes[h] - 20)/10
        ax[i,j].tick_params(axis="x", labelsize=48 - font_reduction)
      ax[i,j].tick_params(axis="y", labelsize=48)
      ax[i,j].yaxis.set_major_locator(ticker.MultipleLocator(5))
      ax[i,j].set_ylim(0,27)
      ax[i,j].set_xticks(x)
      string_labels = list()
      for lbl in average_df.label:
        if len(str(lbl)) == 1:
          string_labels.append(str(lbl).zfill(2))
        else:
          string_labels.append(str(lbl))
      ax[i,j].set_xticklabels(string_labels)
  title = str(
    "Relationship between "
    + method.split("_")[0].upper()
    + " "
    + method.split("_")[1].title()
    + "\n"
    + "Labels and Place at Finals"
  )
  fig.suptitle(title, y=0.925, fontsize = 100)
  plt.subplots_adjust(hspace = 0.6, wspace=0.1)
  r = fig.canvas.get_renderer()
  get_bbox = lambda axis: axis.get_tightbbox(r).transformed(fig.transFigure.inverted())
  bboxes = np.array(list(map(get_bbox, ax.flat)), mtrans.Bbox).reshape(ax.shape)
  #Get the minimum and maximum extent, get the coordinate half-way between those
  xmax = np.array(list(map(lambda b: b.y1, bboxes.flat))).reshape(ax.shape).max(axis=0)[0]
  xmin = np.array(list(map(lambda b: b.y0, bboxes.flat))).reshape(ax.shape).min(axis=0)[0]
  ymax = np.array(list(map(lambda b: b.y1, bboxes.flat))).reshape(ax.shape).max(axis=1)
  ymin = np.array(list(map(lambda b: b.y0, bboxes.flat))).reshape(ax.shape).min(axis=1)
  ys = np.c_[ymax[1:], ymin[:-1]].mean(axis=1)
  # Draw a horizontal lines at those coordinates
  fivethirtyeight_colors = [
    '008fd5', # blue
    'fc4f30', # red
    'e5ae38', # yellow
    '6d904f', # green
    '8b8b8b', # gray
    'bbbbbb', # lightgray
    'cfcfcf', # lightlightgray
    '810f7c', # purple
  ]
  for y in ys:
    line = plt.Line2D(
      [xmin,xmax], [y,y], 
      linewidth=10, 
      linestyle="dashed", 
      transform=fig.transFigure, 
      color="#bbbbbb"
    )
    fig.add_artist(line)
  for i in range(len(values_between)):
    values_between[i] = str(values_between[i])
  filename = str(
    "label_plot"
    + "_"
    + method
    + "_"
    + "_".join(elbow_types)
    + "_"
    + "_".join(values_between)
    + "."
    + file_extension
  )
  filename="test_2.png"
  plt.savefig(
    fig_dir / "plots" /filename, 
    bbox_inches="tight",
    dpi = fig.dpi//3.5
  )
  plt.close("all")
  return fig_dir / "plots" / filename
#+END_SRC

#+RESULTS:
: /Users/antoniomendes/AUC_code/capstone/capstone_eurovision/plots/test_2.png

***** Worst Cluster Data
#+BEGIN_SRC python
worst_cluster_df = merged_feature_df[merged_feature_df.label == 6].sort_values(
  by=["distance_from_center"], 
  ascending=True
)

worst_cluster_df[[
  "year_country",
  "track",
  "label",
  "distance_from_center",
  "place_final"
]]
#+END_SRC

#+RESULTS:
#+begin_example
             year_country                                   track  label  distance_from_center  place_final
127           2012-France                        Echo (You and I)      6              0.789030         22.0
176   2018-Czech Republic                 Lie to Me - ESC Version      6              0.862079          6.0
218          2012-Ireland                               Waterline      6              1.147285         19.0
284          2012-Belarus                       We Are the Heroes      6              1.907800          NaN
179         2015-Slovenia               Here for You - Radio Edit      6              2.114024         14.0
237          2012-Austria                      Woki mit deim Popo      6              2.219203          NaN
51           2014-Romania  Miracle (Eurovision Song Contest 2014)      6              2.351578         12.0
162           2012-Norway                                    Stay      6              2.506686         26.0
5    2014-North Macedonia       To the sky ( Where do we go now )      6              2.555697          NaN
98        2013-Montenegro  Igranka - Eurovision 2013 - Montenegro      6              2.637917          NaN
128           2011-Latvia                       Angel In Disguise      6              3.764333          NaN
270         2018-Slovenia                                Hvala Ne      6              4.153706         22.0
#+end_example

***** Best Cluster Data
#+BEGIN_SRC python
best_cluster_df = merged_feature_df[merged_feature_df.label == 1].sort_values(
  by=["distance_from_center"], 
  ascending=True
)

best_cluster_df[[
  "year_country",
  "track",
  "label",
  "distance_from_center",
  "place_final"
]]
#+END_SRC

#+RESULTS:
#+begin_example
         year_country                                         track  label  distance_from_center  place_final
199   2013-Azerbaijan                        Hold me - Full Version      1              0.369338          2.0
70       2011-Moldova                                      So Lucky      1              0.493725         12.0
180       2010-Sweden                               This Is My Life      1              0.516193          NaN
197  2010-Netherlands              Ik Ben Verliefd (sha - La - Lie)      1              0.537736          NaN
198   2019-Montenegro                                        Heaven      1              0.593853          NaN
209  2015-Netherlands                                    Walk Along      1              0.814427          NaN
137       2015-Russia                              A Million Voices      1              1.018144          2.0
89       2015-Georgia           Warrior - Eurovision 2015 - Georgia      1              1.061204         11.0
241      2013-Moldova                                         O Mie      1              1.124369         11.0
281       2010-Greece                                           Opa      1              1.172750          8.0
247      2011-Albania                                     Knga Ime      1              1.182675          NaN
190      2019-Estonia                                         Storm      1              1.184182         20.0
279       2015-Serbia  Beauty Never Lies - Eurovision 2015 - Serbia      1              1.207740         10.0
40   2019-Switzerland                                    She Got Me      1              1.231571          4.0
221       2013-Russia                                       What If      1              1.279285          5.0
#+end_example
